{
  "_name_or_path": "meta-llama/Llama-2-7b-hf",
  "architectures": [
    "LlamaForCausalLM"
  ],
  "auto_map":{
     "AutoModelForCausalLM":"modeling_llama_larosa.LlamaForCausalLM",
     "AutoConfig": "configuration_llama.LlamaConfig"
  },
  "bos_token_id": 1,
  "eos_token_id": 2,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "initializer_range": 0.02,
  "intermediate_size": 11008,
  "max_position_embeddings": 4096,
  "model_type": "llama",
  "num_attention_heads": 32,
  "num_hidden_layers": 32,
  "num_key_value_heads": 32,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "tie_word_embeddings": false,
  "torch_dtype": "float16",
  "transformers_version": "4.31.0.dev0",
  "use_cache": true,
  "vocab_size": 32000,
  "Q_path": "llama2_act_rotate_mlp_and_attn_seperate_Q/",
  "sparse_level": 0.25,
  "_attn_implementation":"flash_attention_2"
}
